Repository: jaittola/calculatrice
Catalog: Localizable.xcstrings
Source language: en
Languages: fi

# Alt1
source: Calculate the function shown on the top left of each function button
fi: Näppäinten vasemman yläkulman toiminto

# Alt2
source: Calculate the function shown on the top right of each function button
fi: Näppäinten oikean yläkulman toiminto

# Backspace
source: Backspace; erase the previous input
fi: Poista edellinen merkki

# Calc3rdRoot
source: The 3rd root of a value
fi: Tyhjennä pino

# CalcArcCos
source: Inverse cosine
fi: Arkuskosini (kosinin käänteisfunktio)

# CalcArcSin
source: Inverse sine
fi: Arkussini (sinin käänteisfunktio)

# CalcArcTan
source: Inverse tangent
fi: Arkustangentti (tangentin käänteisfunktio)

# CalcCombinations
source: Combinations of two values
fi: Kahden kokonaisluvun kombinaatiot

# CalcCos
source: Cosine of an angle
fi: Kosini

# CalcCube
source: Cube of a value
fi: Kolmas potenssi

# CalcDivision
source: Divide the two topmost stack values
fi: Jaa pinon kaksi päällimmäistä arvoa

# CalcExp
source: Exponential function of a value
fi: Eksponentti

# CalcExp10
source: 10-based power function of a value
fi: 10-kantainen eksponentti

# CalcFactorial
source: Factorial (n!) of a whole number
fi: Kokonaisluvun kertoma (n!)

# CalcInv
source: Inverse of a value
fi: Käänteisluku

# CalcLn
source: Natural logarithm of a value
fi: Luonnollinen logaritmi

# CalcLog10
source: 10-based logarithm of a value
fi: 10-kantainen logaritmi

# CalcMinus
source: Subtract the two topmost stack values
fi: Vähennä pinon kaksi ensimmäistä arvoa

# CalcMultiply
source: Multiply the two topmost stack values
fi: Kerro pinon kaksi päällimmäistä arvoa

# CalcNthRoot
source: The nth root of a value
fi: Yleinen juuri

# CalcPermutations
source: Permutations of two values
fi: Kahden kokonaisluvun permutaatiot

# CalcPlus
source: Add the two topmost stack values
fi: Laske yhteen pinon kaksi päällimmäistä arvoa

# CalcPow
source: Exponentiation
fi: Eksponentti

# CalcSin
source: Sine of an angle
fi: Sini

# CalcSqrt
source: Square root of a value
fi: Neliöjuuri

# CalcSquare
source: Square of a value
fi: Toinen potenssi

# CalcTan
source: Tangent of an angle
fi: Tangentti

# ClearStack
source: Clear the stack
fi: Tyhjennä pino

source: Close
fi: Sulje

# ComplexConjugate
source: The complex conjugate of a complex number
fi: Kompleksikonjugaatti

source: Copy
fi: Kopioi

# DecimalFormat
source: Display the topmost stack value in decimal format
fi: Muunna arvo desimaaliesitykseen

# DisplayAsFraction
source: Show fraction as an improper fraction (e.g., 3 1/3 -> 10/3)
fi: Muunna sekaluku murtolukumuotoon (esim. 3 1/3 -> 10/3)

# ErrArithmeticOverflow
source: The result is too large (overflow)
fi: Arvo on liian suuri (ylivuoto)

# ErrBadCalculationOp
source: Calculation failed
fi: Laskutoimituksessa tapahtui virhe

# ErrBadInput
source: Invalid input
fi: Virheellinen syöte

# ErrDivByZero
source: Division by zero
fi: Jakaja on nolla

# ErrInvalidComplexDimension
source: Creating a complex number requires two values
fi: Kompleksilukuun tarvitaan kaksi komponenttia

# ErrNonIntegerInputToRational
source: You must use whole numbers with fractions
fi: Murtoluvuissa pitää käyttää kokonaislukuja

source: Error
fi: Tapahtui virhe

# ErrUnsupportedValueType
source: This calculation cannot be performed with the provided input values.
fi: Arvoa ei voi käyttää tässä laskutoimituksessa

# GenericHelpBody
source: Calccis is a reverse-polish-notation (RPN) calculator. To perform a calculation, enter the values to the stack first, and then select the calculation. For example, to calculate 1 + 2: - Press '1' and press 'Enter'. - Press '2' and press 'Enter'. - Press '+'. Now, you should see the result '3' on the stack.
fi: Calccis on RPN (reverse polish notation) -tyyppinen pinolaskin. Laskutoimituksessa käytettävät numerot syötetään ensin pinoon, jonka jälkeen valitaan laskuoperaatio. Esimerkki: laskeaksesi 1 + 2; - paina '1' ja 'Enter', - paina '2' ja 'Enter', - Paina lopuksi '+'. Tulos '3' näkyy nyt pinossa.

# Help
source: Show help
fi: Apua

# HelpFunctions
source: Calculator Functions
fi: Laskimen toiminnot

# HelpTitle
source: Using Calccis
fi: Calccis-laskimen käyttöohje

# ImaginaryPart
source: The imaginary part of a complex value
fi: Kompleksinumeron imaginaariosa

# InputExponent
source: Input the exponent for scientific notation (y * 10ˣ)
fi: Syötä tieteellisen numeromuodon eksponenttiosa (y * 10ˣ)

# MakeComplex
source: Create a complex number
fi: Luo kompleksiluku pinon kahdesta päällimmäisestä arvosta

# MakeImaginary
source: Create an imaginary value
fi: Luo imaginääriluku

# MakeMixedRational
source: Create a fraction from a whole part and a fractional part
fi: Luo murtoluku kokonais- ja murto-osista

# MakePolarComplex
source: Create a complex number in polar format from a radius and angle
fi: Luo polaarimuotoinen kompleksiluku pinon kahdesta päällimmäisestä arvosta

# MakeRational
source: Create a fraction
fi: Luo murtoluku

# PickSelected
source: Copy the selected value from the stack to the top of the stack
fi: Kopioi valittu arvo pinon päälle

# PopStack
source: Pop the topmost value from stack
fi: Poista ensimmäinen arvo pinosta

# RealPart
source: The real part of a complex number
fi: Kompleksiluvun reaaliosa

# Redo
source: Redo an operation that was previously undone
fi: Palauta aiemmin peruutettu toiminto

# ScientificFormat
source: Display the topmost stack value in scientific notation (y × 10ˣ)
fi: Näytä arvo tieteellisessä muodossa (y * 10ˣ)

# StackEnter
source: Add a new value to stack
fi: Lisää uusi arvo pinoon

# SwapAngleMode
source: Change angle input unit between degrees and radians
fi: Vaihda kulmayksikköä asteiden ja radiaanien välillä

# SwapTop2
source: Swap the two topmost values on the stack
fi: Vaihda pinon kahden päällimmäisen arvon paikkaa

# ToCartesian
source: Convert a complex number to cartesian representation
fi: Muunna kompleksiluku reaali- ja imaginaarimuotoon

# ToPolar
source: Convert a complex number to polar coordinate representation
fi: Muunna kompleksiluku napakoordinaatistoesitykseen

# Undo
source: Undo the previous operation
fi: Peruuta edellinen toiminto
